{"0":{"Job_Title":"Education Success Team Lead","Job_Description":"We are seeking a collaborative, detail-oriented, results-driven Team Leader to head our Education Success team that serves open-access and two-year institutions of higher education. In this position, you will play a key role in building out strategy for the team, providing our higher education stakeholders with the personal attention, data solutions, and customer service they have come to expect.\n The position requires an understanding of higher education, with an emphasis on two-year and open-access institutions, at every level of the organization (from the decision-makers to faculty and analysts), and to help ensure our partners are equipped with the knowledge, data, and tools they need to analyze and integrate their work into the broader institution.\nIn this role, you would:\nLead and facilitate communication between and within the Education Success College team, and other relevant stakeholders within Emsi Burning Glass. \nManage day-to-day decisions and maintain strong communication with the University, and Partnerships Team Leads and Vice President of Education Success.\nMentor direct reports and provide support as needed.\nExpand, enhance, and engage and a dynamic, highly motivated team through mentoring, professional development, and growth.\nDevelop a series of strategies and deliverables that help promote the professionalization of the Education Success team.\nThe right candidate will have:\nExcellent social, communication (verbal and written), interpersonal, and presentation skills.\nStrong ability to deliver measurable results and ensure team members also succeed.\nProficiency in using technology and software, including sales and marketing automation software, Salesforce, and Google Suite programs.\nQualitative and quantitative analysis skills.\nA growth mindset and a willingness to learn, adapt, and listen, and lead.\nPerform miscellaneous tasks as required.\nFlexibility to travel when required.\nPreferred Qualifications:\nBachelor’s degree from a regionally accredited institution of higher education.\nThree to six years of work experience; Sales or customer success leadership.\nProven experience with the following: Conceptual solution and value-based selling; DaaS, SaaS account management; Performance-based compensation structure; Client communication and outreach.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Client Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/390d26a0-e45c-4f6d-9bfd-ad7c50da188c"},"1":{"Job_Title":"Data Curator","Job_Description":"A Data Curator at Emsi BG is responsible for evaluating and improving the coverage and accuracy of Emsi’s training sets and models.  The curator’s day to day work primarily consists of 1) internalizing decision criteria and principles, 2) labeling data accordingly, and 3) making good, consistent decisions to deal with ambiguities.  Candidates should be comfortable with spending much of the day reading long lists and making quick decisions about each item.  The curator’s efforts drive the development of machine learning models and benchmarks.\nDaily Responsibilities:\nReading and labeling of natural language elements (e.g. job titles, job postings, company names, etc.)\nRapid and consistent decision making\nWorking with data scientists and software engineers to create decision criteria\n\nKey Skills:\nBasic Excel proficiency\nFluent English, written and spoken\nHigh reading speed\nExcellent Google-fu\nComfortable making decisions independently\nCommunication, collaboration, and teamwork skills\nComfortable working in a structured and disciplined manner as part of a technical organization\nThis position reports to a Managing Taxonomist on Emsi BG’s Classifiers & Extractors team. Career progression includes becoming a taxonomist, manager, or even a software\/data engineer.\n\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Data and Analytics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/d5ff5702-540a-46b3-ac3b-c5c1258eef65"},"2":{"Job_Title":"Data Engineer, Web Scraping","Job_Description":"Emsi Burning Glass is looking for a talented Data Engineer to work on the Web Scraping team. Their primary responsibility is to design, implement, and maintain data pipelines that transform data, adding value to it in the process. In carrying out the objective of this position, a successful candidate will be committed to our values by working with gratitude, operating as a team, and partnering with our customers.\nCore Responsibilities\nCreate and improve processes, tools, workflows, and resilient data architecture to scrape web content.  \nManage data accuracy and quality. \nIdentify and rectify any issues with breaks as well as scale scrapers as needed.\nOrganizational Relationships\nThis position reports to the Senior Director of Data Innovation.\nKnowledge, Skills, and Abilities\nWeb scraping experience (Scrapy or similar technologies)\nSolid understanding of web technologies (HTML, JavaScript, CSS, XPath, JSON, etc)\nExperience with ETL and creating data pipelines\nBasic Linux and Git experience\nPython\nScrapy Python library\nAWS\/AWS Batch\nFamiliarity with data processing tools (pandas, regex, SQL)\nTraits\nAttention to detail\nSelf-starter\nCurious\nCustomer Oriented\nOrganized\nProblem solving\n\nCredentials and Experience\n2+ years Python experience, preferred\nProfessional experience with web scraping preferred\nBachelor’s degree, preferred\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Remote (Work From Home) US","Type":"Full Time","Department":"Data and Analytics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/1411c674-9a27-427e-be67-1aa430e7fa5a"},"3":{"Job_Title":"Data Scientist","Job_Description":"A Data Scientist at Emsi Burning Glass works with the Product and Data teams to produce innovative models, datasets, and visualizations that address our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing actionable insights to our product suite.\nCore Responsibilities\nBuild pragmatic, scalable, and statistically rigorous solutions to large-scale labor market data problems by leveraging or developing state-of-the-art statistical and machine learning methodologies on top of Emsi BG’s data infrastructure.\n Work with and manage very large (and messy) data sets; build ML pipelines that scale to work with this data effectively. Experience working with and designing continuous machine learning pipelines is required.\nSupport product development by performing quantitative analysis using Emsi Burning Glass’s world-class demand and supply data, as well as other data sources to investigate, manipulate, and model solutions for products.\nManage large and\/or complex projects to completion. Make business\/technology trade-offs when appropriate.\nWork cross-functionally to define problem statements, collect data, build analytical models and make recommendations.\nChampion the incorporation of new tools\/methods\/techniques.\nPossess a strong ability to connect data science results and methods with use cases and communicate key insights and recommendations to internal and external stakeholders across the organization.\nDevelop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences.\nResearch and drive new product capabilities searching for innovative ideas and product enhancements using data.\nContribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague. Actively mentor and support junior colleagues.\nKnowledge, Skills, Abilities\nProficiency with SQL, Python, and related analytical tools and programming languages. \nExperience with Machine Learning, Statistics, or other data analysis tools and techniques.\nStrong written and verbal communication skills.\nStrong analytical skills.\nStrong quality assurance skills with attention to detail in both quantitative analyses and technical writing\/documentation.\nProficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint.\nExperience with Tableau or similar BI tools is a plus.\nAbility to work effectively both independently and in a team environment.\nCreative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings.\nCredentials and Experience\nBachelor’s degree or above in Data Science, or a field with a strong quantitative and analytic focus (e.g. Computer Science, Engineering, Mathematics, Statistics, Operations Research or other related fields).\n3 - 5 years of industry or graduate research experience solving analytical problems and building models using quantitative, statistical or machine learning approaches.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Remote (Work From Home) US","Type":"Full Time","Department":"Data and Analytics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/e846f315-e603-42f6-a6da-7250ac571176"},"4":{"Job_Title":"Director of Data Analytics","Job_Description":"The Director of Data Analytics leads data science and analytics teams and is a partner in our transformation into a data driven organization. The Director of Data Analytics pushes the company to use data in ways that didn’t seem possible. This role focuses on turning company data assets into insights that solve our customers’ most complex problems. The Director of Data Analytics is responsible for all aspects of data analytics, data science, and data pipeline engineering: designing, developing, and testing data models, and maintaining data pipelines that feed products with insights our customers crave. This individual acts as a partner with technology and software teams to build and deliver internal products and services at scale that support the business.\nResponsibilities:\nEngage business and product stakeholders to understand their roadmap, strategize and develop hypotheses, and design analytical models to drive business decisions.\nParticipate in product design offering potential insights to better EBG products and convey the feasibility in terms of data quality and implementation challenge for requested insights.\nDesign model algorithms encompassing data science, statistical models, manipulation of public datasets, and data-driven user workflows.\nCollaborate with Engineering, Marketing, and other Analytics teams to deliver impactful data and insights. Facilitate collaboration between technology teams to capture dependencies and ensure that correct technologies are built to meet the needs of EBG products.\nOwn and lead the organizational data science and data analytics capabilities\nCommunicate key insights and recommendations to senior leadership across the organization to influence the strategic agenda.\nEngage with the Research teams to understand its applicability for productization in products\nHire, manage, and develop a team of analysts and data scientists, including coaching, onboarding, and training.\nRequirements:\nBachelor's degree in Statistics, Mathematics, Economics, Engineering, or related technical field. Master’s degree preferred.\n5+ years experience developing analytical and\/or data science methods.  3+ years in a hands-on data analytics management role.\nExperience defining a clear, robust roadmap and delivering against it.\nExperience designing and implementing highly visible, complex, and innovative analytical solutions that drive business decision making.\nDemonstrated success influencing senior level stakeholders on strategic direction based on insights backed by in-depth analysis.\nStrong written and verbal communication.\nExperience in mentoring and developing a team.\nOpportunities within Emsi Burning Glass also exist on other teams. Please visit our job board to view open positions.\n\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Full Time","Department":"Data and Analytics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/932d5767-e635-49c4-bd66-faab540bc3a5"},"5":{"Job_Title":"Machine Learning Engineer","Job_Description":"At Emsi Burning Glass, Machine Learning Engineers improve the efficiency of our data science capabilities by implementing tooling and pipelines that automate the training, testing, and deployment of data science models.  ML Engineers work to leverage and scale the business by applying software engineering techniques and principles to data science work.  Machine Learning Engineers work with the team to build end-to-end data science and machine learning systems and deploy the models to our APIs. Machine Learning Engineers collaborate with Software Engineers, Systems Engineers, and Hardware Engineering teams across the company.\nCore Responsibilities\nImplement, use and promote the use of experiment tracking systems to ensure that model performance is reproducible, observable, and debuggable\nDevelop and implement scalable and efficient model training workflows on large-scale datasets to address various business problems using sophisticated statistical modeling, machine learning techniques\nWrite and test pipeline code for developing and validating ML models, and automating tests and deployment.\nDevelop workflows for debugging model performance\nDevelop transient large-scale computing clusters, where appropriate, for model training using infrastructure-as-code and the cloud.\nCoordinate with cross-functional teams on new ideas ensuring consistency across the platform.\nPerform other duties as assigned.\nAdhere to Company’s core values.\nCredentials and Experience\nBachelor’s degree or above in Data Science, or a field with a strong quantitative and analytic focus (e.g. Computer Science, Engineering, Mathematics, Statistics, Operations Research or other related fields).\n3 - 5 years of industry or graduate research experience solving analytical problems and building models using quantitative, statistical or machine learning approaches.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Remote (Work From Home) US","Type":"Full Time","Department":"Data and Analytics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/f75b4657-bdfb-47b9-8520-7d9bde8d93b8"},"6":{"Job_Title":"Senior Data Scientist","Job_Description":"The Senior Data Scientist at Emsi Burning Glass works with the Product and Data teams to produce innovative models, datasets, and visualizations that address our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing actionable insights to our product suite.\nCore Responsibilities\nBuild pragmatic, scalable, and statistically rigorous solutions to large-scale labor market data problems by leveraging or developing state-of-the-art statistical and machine learning methodologies on top of Emsi BG’s data infrastructure.\n Work with and manage very large (and messy) data sets; build ML pipelines that scale to work with this data effectively. Experience working with and designing continuous machine learning pipelines is required.\nSupport product development by performing quantitative analysis using Emsi Burning Glass’s world-class demand and supply data, as well as other data sources to investigate, manipulate, and model solutions for products.\nManage large and\/or complex projects to completion. Make business\/technology trade-offs when appropriate.\nWork cross-functionally to define problem statements, collect data, build analytical models and make recommendations.\nChampion the incorporation of new tools\/methods\/techniques.\nPossess a strong ability to connect data science results and methods with use cases and communicate key insights and recommendations to internal and external stakeholders across the organization.\nDevelop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences.\nResearch and drive new product capabilities searching for innovative ideas and product enhancements using data.\nContribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague. Actively mentor and support junior colleagues.\nKnowledge, Skills, Abilities\nProficiency with SQL, Python, and related analytical tools and programming languages. \nExperience with Machine Learning, Statistics, or other data analysis tools and techniques.\nStrong written and verbal communication skills.\nStrong analytical skills.\nStrong quality assurance skills with attention to detail in both quantitative analyses and technical writing\/documentation.\nProficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint.\nExperience with Tableau or similar BI tools is a plus.\nAbility to work effectively both independently and in a team environment.\nCreative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings.\nCredentials and Experience\nBachelor’s degree or above in Data Science, or a field with a strong quantitative and analytic focus (e.g. Computer Science, Engineering, Mathematics, Statistics, Operations Research or other related fields).\n3 - 5 years of industry or graduate research experience solving analytical problems and building models using quantitative, statistical or machine learning approaches.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Remote (Work From Home) US","Type":"Full Time","Department":"Data and Analytics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/6c85559c-8037-43ab-9694-069d995393f1"},"7":{"Job_Title":"Software Engineer","Job_Description":"Emsi Burning Glass is looking for a skilled software engineer to work on the Classifiers & Extractors team.  This team builds and maintains high-performance text extraction and classification libraries used to analyze job postings, resumes, and similar documents.  In addition to the machine learning solutions, this team also produces the internal tooling and data pipelines to support teams of taxonomists and curators working to continuously improve Emsi’s classifications and libraries.\n\nThe ideal candidate has significant experience working in high-performance systems languages, a working knowledge of linear algebra, and at least basic familiarity with machine learning techniques.\nDaily Responsibilities:\nDevelop and maintain extractors, classifiers, and the data pipelines to support them.\nResearch the most effective solutions to text extraction and classification problems.\nOptimize solutions for maximal document per second per core throughput.\nWork with Emsi’s taxonomists and data curators to build the internal tooling and data pipelines necessary to continuously improve our libraries.\nKey Skills:\nSystems programming on Linux, including working knowledge of virtual memory, optimizing for cacheline performance, and using the perf toolkit.\nProficient in the D programming language or similar (C, C++).\nAt least basic knowledge of machine learning techniques.\nWorking knowledge of linear algebra, experience with Intel MKL or similar desirable.\nGood knowledge of algorithms and data structures.\nFluent English, written and spoken.\nGit version control.\nDebugging with GDB.\nAWS S3, EC2, Athena.\nThis position reports to the C&E Team Lead and has significant opportunity for career progression either as an individual contributor or as a team lead or manager.\n\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Data and Analytics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/e9fa0594-6ac2-45d1-b318-dac2cd5bfd0a"},"8":{"Job_Title":"Thought Leadership Research Analyst","Job_Description":"We seek a Research Analyst to join our Thought Leadership team. The Research Analyst will perform quantitative research to investigate important issues in the labor market, support client engagements, and improve the data available for Emsi Burning Glass products.\n\nEmsi Burning Glass’s research is driving the national conversation around some of the most critical issues facing the job market.  Some recent projects include:\n\n-Revealing and compiling labor market insights for inclusion in leading national publications such as the Wall Street Journal and the New York Times and for partners such as the World Economic Forum, and expressed through our thought leadership on issues related to skills, jobs and the economy.\n\n- Identifying the emerging skills and job opportunities that will inform major investments in skills training by local, state and national governments, corporations, and major philanthropic and corporate foundations.  \n\n-Investigating the viability of new degree programs under development by universitiesConducting analytics that shape the hiring and staff development practices of Fortune 500 firms.\n\nThe ideal candidate will possess both strong quantitative research skills, and will have a passion for using data to illustrate key trends and tell actionable stories.\nResponsibilities include:\nManipulating, validating and analyzing data using SQL, Python and other analytical tools to develop insights about emerging trends in the labor market.\nComparing summary statistics on supply and demand across industries and geographies, constructing indices to measure labor market concepts such as innovation and digitization and performing trend analyses to measure changes in job characteristics over time\nCreating visualizations of complex data sets using Tableau, Python and\/or Excel to tell compelling stories\nPulling and preparing data for public reports and media outreach efforts.\nGenerating first drafts of client-ready outputs in Excel and PowerPoint and contributing to written reports on research outcomes\nParticipating in client and company-wide meetings and presentations\nContributing to positive team dynamics by participating in team-building activities and being a supportive colleague.\nRequirements:\nUndergraduate degree in economics, statistics, or another quantitatively intensive field.\nExperience manipulating, cleaning, and analyzing large datasets.\nProficiency in at least one of the following statistical analysis\/data management tools: SQL, R, Python, SAS, or STATA.\nExperience creating data visualizations in Excel, PowerPoint, Tableau, R, or other tools.\nHighly detail-oriented with superior organizational skills.\nProficiency in Excel and PowerPoint.\nExcellent writing and communication skills.\nIntense intellectual curiosity.\nAt Emsi Burning Glass, we strive to create a job market that works for everyone. We are an analytics software company whose tools play a growing role in informing the global conversation on education and the workforce by turning data into insight. Powered by the world’s largest and most sophisticated database of jobs and talent, we deliver real-time data and breakthrough planning tools that inform careers, define academic programs, and shape workforces.\n Emsi Burning Glass’ applications drive practical solutions and are used across the global job market: by educators in aligning programs with the market, by employers and recruiters in filling positions more effectively, and by policy makers in shaping strategic workforce decisions. At the same time, Emsi Burning Glass’ data-driven applications for workers and students help them choose career goals and build the skills they need to get ahead.\n Analytics are at the heart of our mission, and our Analytics teams play a critical role in delivering insights for our products and clients from hundreds of millions of job postings and resumes. The teams are responsible for developing models for classifying, validating, and understanding the job market data in our software products; ensuring and maintaining data quality; and creating reports which analyze areas of the labor market that are critical to our clients and partners.\n\n\nEmsi Burning Glass is an equal opportunity employer.\n APPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Full Time","Department":"Economics","Link":"https:\/\/jobs.lever.co\/economicmodeling\/90e27c97-cc63-42e6-9247-9799874de896"},"9":{"Job_Title":"API Developer","Job_Description":"Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Much of our data is available via APIs which power our software applications, and more recently are available to external customers. You can view our current API offering here: https:\/\/www.economicmodeling.com\/apis\/. If you are interested in joining a team focused on building out APIs and related infrastructure, we’d love to hear from you. In this role you would be responsible both for expanding our microservice architecture to include new APIs and maintaining our existing fleet.\nPeople who succeed in this position are…\nTeam oriented and ready to work closely with other developers\nDetermined to produce clean, well-tested code\nComfortable working in rapid development cycles\nSkilled communicators\nEnthusiastic about learning and pushing the envelope\nCandidates must have…\nExperience with Python\nExperience using a version control system\nFamiliarity with ElasticSearch\nFamiliarity with REST APIs\nDevOps experience\nGreat candidates also have…\nExperience with relational databases like PostgreSQL\nExperience with ElasticSearch\nExperience working in a microservice architecture\nExperience building and running APIs\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Engineering","Link":"https:\/\/jobs.lever.co\/economicmodeling\/d2f21e23-9c6f-4526-afec-ca6e3c36bd36"},"10":{"Job_Title":"Full Stack Web Developer","Job_Description":"Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need an experienced developer to join us in producing premier software tools for understanding labor market data. \n\nIf you’re ready to join a high-functioning team of full stack devs working closely with product managers, data engineers, and designers to create interfaces and visualizations that make nuanced data intelligible, we’d love to hear from you. Applicants to this posting will be considered for positions on the Analyst, CareerCoach, and SkillsMatch development teams. \nPeople who succeed in this position are:\nTeam oriented and ready to work closely with other developers\nComfortable with working in rapid development cycles\nSkilled oral and written communicators\n Enthusiastic for learning\nPrepared to contribute at a strategic level to engineering excellence discussions from day one\nCandidates must have:\nTwo years of experience with React development in a production environment\nTwo years or more experience with server-side languages like PHP, Python, or Node\nOne or more years of experience managing production environments in AWS\nWorking knowledge of structured databases, e.g. MySQL, PostgreSQL\nGreat candidates also have:\nExperience with microservice architecture\nExperience building and consuming APIs\n\n\nEmsi is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Engineering","Link":"https:\/\/jobs.lever.co\/economicmodeling\/c738640f-c582-42f2-8cfc-27657549236c"},"11":{"Job_Title":"Lead Software Engineer","Job_Description":"As a lead software engineer at EmsiBG, you’d be a mix of both player and coach – doing both individual contributor work and managing. Your day-to-day work would include coding on the team, giving you valuable insights into your team’s work, and giving you the chance to grow further as an engineer. You’d be regularly giving your direct reports opportunities to grow and excel by delegating important tasks to them. If you’re interested in building a culture of grateful excellence, if you want to mentor junior engineers while growing your own skills in both engineering and leadership, we’d love to meet you. \nPeople who succeed in this position are:\nTeam-oriented and ready to work closely with other developers\nComfortable with working in rapid development cycles, including prototyping\nSkilled communicators\nReady to lead by example\nGrateful\nRequirements:\n3 years of experience in building production applications with ES6 and React.js (Angular, Svelte, Vue also considered)\n3 years of experience with server-side languages like Node, Python, and PHP.\n3 years of experience with production environments in AWS (Google Cloud, Azure also considered).Experience with structured databases (e.g. MySQL, PostgreSQL).\nGreat candidates also have:\nBuilt data visualization web products\nCollaborated with designers and product owners\nExtensive experience with container orchestration and tools like Docker, Kubernetes, and Terraform.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Engineering","Link":"https:\/\/jobs.lever.co\/economicmodeling\/2638f99f-532c-403a-8c34-a9180a5e2c60"},"12":{"Job_Title":"Finance Administrative Assistant","Job_Description":"Overview\n\nThe Finance Administrative Assistant reports directly to the Financial Controller and is highly involved in managing day to day tasks for the entire Finance team.  Emsi is looking for a highly organized and motivated individual with strong interpersonal and written communication skills and a strong connection with our company’s core values, bless the customer, bless the employee, and bless the shareholder.\n\nDuties and Responsibilities\nManage corporate credit card usage by collecting and documenting all receipts from corporate card holders in a timely manner.\nUpon a mangers request, issue corporate credit cards for new employees.\nRespond to customer queries in a polite and timely manner, while knowing when to include other Finance team members.\nEstablish a working knowledge of Emsi’s customer system of record, SalesForce, to access to customer accounts.\nKeep excellent records of all communication with customers.\nCommunicate effectively with customers via phone and email regarding late payments.\nFollow-through with customers until resolution of late accounts is established.\nAssist the Controller in the day to day tasks of running the Finance department as requested.\nMaintain all Finance department records in an orderly fashion.\nJob Qualifications and Requirements\nA degree isn’t mandatory for the Finance Administrator role, but evidence of administrative skills is required. \nA successful candidate possesses attention to detail, data entry, and multitasking skills that balances adhering to process with being attentive to the bigger picture. \nThe Finance Administrative Assistant role interacts with employees and customers on a daily basis, so the ability to interact in a professional and cheerful manner at all times is necessary. \nThe ideal candidate also makes systematic and consistent efforts to ensure Emsi’s late customer payments are brought in and Emsi’s records are in good order, efficiently stewarding Emsi’s resources. \nThe successful candidate balances best processes with thoughtful consideration of the larger picture in order to embody Emsi’s core values: bless the customer, bless the employee, and bless the shareholder.\nEmsi is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time\/Part Time","Department":"Finance","Link":"https:\/\/jobs.lever.co\/economicmodeling\/b0e9c4d7-bc22-4b9d-888e-c0df2f2050da"},"13":{"Job_Title":"Financial Analyst","Job_Description":"The Financial Analyst is part of the Emsi Burning Glass finance team and plays a crucial role in our execution of growth initiatives and constant innovation around optimizing and evaluating existing revenue and expenditure.\n\nSuccess in the role will require a mastery of our culture, history and operating principles to help ensure robust and thorough analysis and prevent flawed analytical results even if “technically correct.” Forms of data involved in this role are not limited to financial but will also include a wide array of operational and HR data with qualitative information and insights. The operating principle for all analysis will be production of meaningful and true analysis, never reducing to the production of numbers to support decisions stakeholders have already made.\n\nIn carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.\nCore Responsibilities\nMaintain a working knowledge of Emsi’s various products and services. \nProduce monthly slide decks for Emsi and BUs (typically within 3 working days of month end). \nSchedule BU meetings to occur within 7 working days of month end. \nAttend BU meetings with (a) ability to comment on any apparent data anomalies or reasonable questions and (b) mechanism to record any agreed changes \/ developments and implement immediately so that the same request is not needed twice. \nCoordinate development and production of any special slide decks whether part of the monthly BU meetings or separately (e.g. BU renewals, sales, product trajectories, cost areas, etc.).\nOrganize data and records, and capably record the results of decisions and discussions so that leadership can rely on your work while assessing success of growth investments.\nProduce scopes for any analytics requests, to be agreed to with your manager before performing an analytics request. This process is to be used for all requests even from those higher up the org chart than your manager (e.g. CEO, parent company, investors). \nQuarterly review of product catalogue in SalesForce with product and business leaders to ensure obsolete products are removed and new products are included, with any additions or removals being approved by COO and CEO.\nPerform required seasonal reporting to assist in launch of new markets, products or similar, which may include weekly cadence of reporting; looking to transition such projects into the typical workflow when increased cadence no longer provides significant value. \nPlay a special role in the annual budget process and periodic forecast updates throughout the year, coordinating such efforts with colleagues on the financial accounting team.\nComplete special projects as assigned (e.g. tracking costs related to a grant, or potential insurance and\/or legal claim.)\nPursue professional development so that your current abilities and experiences do not define the upper limit on what you can contribute to Emsi. This could include advocating for formal professional development but will also include spending time learning from those you are connected with professionally, such as at Emsi’s parent company. \nCollaborate with IT and others in finance to assist in evaluating and implementing analytical tools and systems with foresight to articulate deficiencies that hold you back from success. \nOrganizational Relationships\nThe Financial Analyst reports directly to the Controller and also works closely with COO\/CFO and other stakeholders including BU Leaders, Product, Marketing, Sales and Customer Service Leaders, Sr. Financial Analyst at Parent Company and\/or other designated representatives at Parent Company or other investors and Emsi board members.\nKnowledge, Skills, and Abilities\nStrong written and verbal communication skills with the ability to communicate “up” the organizational chart avoiding any surprises. \nAdvanced knowledge of Excel and proficiency with Microsoft Office Suite. \nCritical-thinking skills.\nStrong organizational skills. \nAbility to handle ambiguous project and maintain feedback through each step to completion.\nAbility to coordinate with broad stakeholder groups. \nAbility to judge and balance confident execution of projects with manager input and review, while maintaining awareness to take direct and indirect feedback around the balancing of these competing priorities.\nAbility to review your own work for anomalies that indicate flaws in analysis and have the energy and intuition to enquire with relevant parties regarding anything that needs validating or testing.\nTraits\nCurious \nFocused \nService-oriented\nAnalytical\nAccountable\nApproachable\nHonest\nForthright \nFlexible\nCredentials and Experience\nBachelor’s Degree in accounting, finance, statistics, economics business administration or a related field. \nSaaS experience preferred.\nPhysical Requirment\/Work Environment\nThose necessary for general office work. \nTypical office environment majority of the time. \nEmsi is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Finance","Link":"https:\/\/jobs.lever.co\/economicmodeling\/e6f7ef80-84b6-4bc9-ac7e-e400a30fbce6"},"14":{"Job_Title":"Senior Accountant","Job_Description":"The role of the Senior Accountant primarily consists of assisting the VP of Finance in day-to-day accounting tasks, including, but not limited to data entry and basic internal reporting.  It is assumed that each member in the Finance department seeks out ways to bring efficiency to basic operations of finance (and others) through technology, process, and quality management.  It is also assumed that each member of the Finance department meets set deadlines, completes work in a timely manner, and is self-directed in their specific task management.\nSpecific Job Duties and Responsibilities Could Include:\nMaintain the Fixed Asset ledger by recording asset additions and\/or disposals and posting monthly depreciation expense.\nMaintain the Internal Use Software Capitalization schedule and prepare the monthly posting.\nMaintain Prepaids Schedules by recording prepayments made and posting monthly expensing journals.\nPrepare and post biweekly payroll journal entries.\nFile statutory returns including VAT, Sales Tax, and Use tax returns in an accurate and timely fashion.\nAssist with month-end close process including ownership of specifically assigned tasks and deadlines.\nManage the accounting and support for foreign operations (specifically Canada and UK) – including accurate and timely monthly\/annual close and tax filings.\nConsolidate the subsidiary accounts into parent company books.\nPopulate monthly and weekly reports and\/or presentations to help drive good decision making across the organization.\nParticipate in the annual GAAP audit with a good understanding of professional etiquette.\nPerform other ad hoc projects for the Controller and CFO.\nPreferred Qualifications\nExperience with QuickBooks (or similar) and MS Excel required\nExperience in accruals, prepayments, foreign currencies, and fixed assets\nEssential Functions, Knowledge, Skills and Abilities\nBachelor’s degree in Accounting Experience with QuickBooks (or similar) and MS Excel required\nExperience in accruals, prepayments, foreign currencies, and fixed assets\nProven ability to communicate clearly and concisely, orally and in writing\nProven ability to work effectively to meet goals and deadlines with minimal supervision\nHighly creative problem-solving skills and an ability to tailor efforts based on importance of the issue being addressed\nA hands-on, detail-oriented mindset with the ability to look beyond the box\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Finance","Link":"https:\/\/jobs.lever.co\/economicmodeling\/4594e8cf-ca83-49d0-ac80-8ee22acd0c1c"},"15":{"Job_Title":"Junior Corporate Attorney","Job_Description":"At Emsi Burning Glass, we strive to create a job market that works for everyone. Our analytics software and custom research are powered by the world’s largest and most sophisticated database of jobs and talent. We deliver real-time data, breakthrough planning tools, and tailored research that inform careers, define academic programs, and shape workforces.\n\nThis role will report to the General Counsel of Emsi Burning Glass.\n\nSalary: DOE\nResponsibilities\nDraft and negotiate a variety of commercial agreements, including software license and subscription agreements, master services, confidentiality and other operational and commercial agreements in collaboration with the legal team.\nProvide advice and counsel to the business team leaders on all legal matters, in consultation with other members of the legal team, as necessary.\nDevelop and maintain a strong knowledge of the products and objectives of the Company’s operations.\nAssist the legal team’s efforts in the preparation, implementation and refinement of forms, processes and procedures, including maintaining records and filing correspondence and legal documents in the Company’s legal database.\nProvide substantive support for the rest of the legal team, such as conducting legal and general research, preparing and filing documents, and navigating government websites and filings.\n\nQualifications\n J.D. degree from a recognized law school\nProficiency with Google Suite, Word, Excel, PowerPoint, Adobe Acrobat, and the internet and\/or ability to quickly learn and use new software tools\nExperience working at a law firm or in-house legal department helpful but not required\nAbility to thrive in a dynamic, fast-paced environment and adapt to rapidly shifting priorities\nProactive, resourceful self-starter with the ability to work independently while exercising good judgment on when to seek guidance\nExcellent interpersonal and communication skills (both oral and written)\nStrong organizational skills; ability to efficiently prioritize and manage numerous projects simultaneously under deadline pressure, while maintaining excellent results and attention to detail\nHighly collaborative, team-oriented spirit\nWillingness to collaborate with and have work reviewed by General Counsel\nHigh level of integrity, professionalism, and desire to grow!\nOpportunities within Emsi Burning Glass also exist on other teams. Please visit our job board to view open positions.\n\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Legal","Link":"https:\/\/jobs.lever.co\/economicmodeling\/fb5f705c-4792-4cc0-adb4-ea9fc946b824"},"16":{"Job_Title":"Marketing Director","Job_Description":"The Marketing Director will oversee the day-to-day operations of marketing activities for the Community Division at Emsi Burning Glass set forth by strategies collaborated on with the VP of Business Development.\n The focus of the Community Marketing Division is to:\nBuild brand and product awareness in the economic development, workforce development, and commercial real estate markets\nGarner a top of funnel approach from creating new contacts to producing a steady flow of quality leads\nDeepen client engagement\n \n\n \n  Responsibilities\nDrive the marketing process forward by gathering insights from products and consumers, developing strategies, executing campaigns, and measuring and optimizing results. \nFind new ways to engage our target audience and execute campaigns that deepen users’ connection with Emsi Burning Glass.\nManage and direct the day-to-day operation of the marketing unit, including management of five staff, and cross collaboration with central marketing department\nExecute strategy through a marketing scrum planning\/methodology\nRepresent Emsi via webinar and in-person presentations though creation of content and some presentations; develop and manage strong internal and external relationships\nSkills\nManagement\nCommunication\nProject Management\nMarketing Strategy\nMarketing Analytics\nDigital Marketing\nGo-To-Market Strategy\nKnowledge and Experience\nCRM Experience [Hubspot]\nLead Generation Marketing\nExperience with Sales\nEmail Marketing\nOpportunities within Emsi Burning Glass also exist on other teams. Please visit our job board to view open positions.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Marketing","Link":"https:\/\/jobs.lever.co\/economicmodeling\/28075f3f-aa30-4b75-b48f-aad55154c071"},"17":{"Job_Title":"Marketing Manager","Job_Description":"Emsi Burning Glass is searching for a full-time Marketing Manager. This position sits within our Talent Department and markets our offerings to Staffing Firms and Enterprise companies.\n\nThis role is an opportunity to drive the marketing process forward by gathering insights from products and consumers, developing strategies, executing campaigns, and measuring and optimizing results. \n\nThe Marketing Manager will be responsible for translating a deep understanding of our customers into inspiring product stories. They will find new ways to engage our audience and execute campaigns that deepen users’ connection with our business.\n\nThe ideal candidate has marketing experience and strong organizational skills. They’re a self-starter who can execute with minimal oversight. They learn quickly and independently. This person also has strong critical thinking and problem-solving skills. Leadership skills are a plus, as this position has many opportunities for growth and added responsibilities.\nPreferred Skills:\nCommunication, working across teams \nProject Management\nTime Management \nProblem Solving\nCritical Thinking\nCollaboration\nMarketing Strategy\nCopy Editing\nMarketing Analytics\nKnowledge & Experience\nCRM Experience [Hubspot]\nLead Generation Marketing\nExperience with Sales\nEmail Marketing\nSearch Engine Optimization\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Marketing","Link":"https:\/\/jobs.lever.co\/economicmodeling\/e52d24a1-a93e-4fe7-bf0d-48b5293eb863"},"18":{"Job_Title":"Web Deveolper I","Job_Description":"At Emsi Burning Glass, we strive to create a job market that works for everyone. We are an analytics software company whose tools play a growing role in informing the global conversation on education and the workforce by turning data into insight. Powered by the world’s largest and most sophisticated database of jobs and talent, we deliver real-time data and breakthrough planning tools that inform careers, define academic programs, and shape workforces.\nRequirements\nThis role will focus on building and maintaining our public facing websites including economicmodeling.com, kb.emsidata.com, and more.\nYou will be responsible for enhancing site speed, implementing content changes, and creating an informative environment for over 2 million annual visitors. \nIn this role you will work closely with designers, marketing strategists, and content writers to develop our marketing sites using a Jamstack architecture (Gatsby and DatoCMS).\n\nRequirements\nSolid understanding of vanilla HTML and CSS (Specificity, Flexbox, Grid, Responsiveness)\nSolid understanding of vanilla JavaScript (Scope, DOM, OOP, Async)\nInterest in web development from a marketing perspective (SEO, Analytics, CRO, etc.)\n\nValuable Experience\nBasic understanding of React (Hooks, State, Props)\nBasic experience with any CSS Framework (we happen to use Tailwind)\nBasic experience with Gatsby\nBasic experience working with any CMS (we happen to use DatoCMS and WordPress)\n\n\nEmsi Burning Glass’ applications drive practical solutions and are used across the global job market: by educators in aligning programs with the market, by employers and recruiters in filling positions more effectively, and by policy makers in shaping strategic workforce decisions. At the same time, Emsi Burning Glass’ data-driven applications for workers and students help them choose career goals and build the skills they need to get ahead.\n Analytics are at the heart of our mission, and our Analytics teams play a critical role in delivering insights for our products and clients from hundreds of millions of job postings and resumes. The teams are responsible for developing models for classifying, validating, and understanding the job market data in our software products; ensuring and maintaining data quality; and creating reports which analyze areas of the labor market that are critical to our clients and partners.\n\n\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Uncategorized","Department":"Marketing","Link":"https:\/\/jobs.lever.co\/economicmodeling\/54fab521-d472-431c-b237-6e9864b5c711"},"19":{"Job_Title":"Cloud Delivery Product Manager","Job_Description":"The Cloud Delivery Product Manager will be responsible for maximizing the value of the current Cloud Delivery products and guide future development efforts. Participating in sales and support conversations with customers, planning new features with engineers, and improving the Cloud Delivery documentation will be the primary focus.  Initially this role will own the integration of EmsiBG’s cloud delivery products including BG Cloud, Emsi Snowflake and NOVA Data Feeds.\nResponsibilities\nOwn and Drive Product Development efforts on Cloud Delivery Platform\nEnsure Cloud Delivery Platform offerings and format align with API Product line\nWork closely with the API Product Manager to ensure unified terminology and approach\nManage Cloud Delivery stats and usage data\nCreate dashboards to support business unit and Product needs\nSupport content creation for Cloud Delivery documentation site\nImprove use case content (Documentation, Guides, Videos)\nStandardize and deliver Cloud Data Dictionary to improve time for clients to implement\nSupport internal Cloud Delivery customers - including consulting and applied research teams\nEnsure the Cloud products meet internal requirements\nManage feedback and create and prioritize new features\/improvements\nCreate and manage continuous improvement projects across the product line\nExpected Proficiencies\nStrong written and verbal communication skills\nStrong organizational skills\nAbility to clearly articulate technical concepts\nBasic SQL knowledge\nAbility to translate client needs into technical requirements\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Product","Link":"https:\/\/jobs.lever.co\/economicmodeling\/5c9bc836-c659-47bd-9477-ce65ce8513fd"},"20":{"Job_Title":"Jr. Product Manager","Job_Description":"Emsi Burning Glass, the leader in labor market analytics, is seeking a product owner who is passionate about helping communities (and community-minded organizations) solve complex workforce and economic development problems through intuitive, well-designed software that delights our clients.  \n\nAs Jr. Product Manager, you’ll be responsible for maximizing the value of our current products to our community clients and serving as the point person for future product development. Your work will include facilitating a cross-functional team to design, develop, and implement new product initiatives; increasing the value and profitability of existing products; and keeping an accurate pulse on the client database being served by said products. This work is done under the supervision of the Director of Product.\n\n\n\nThe Successful Candidate will Thrive at:\nStrategic thinking – you can process a wide variety of inputs to produce a clear, prioritized plan of action that represents the needs of all our users.\nUsing data to make decisions.\nProfessionally communicating and articulating product value and capabilities to existing and future customers via in person, phone, and virtual meetings.\nDiscovering a user's specific needs, jobs to be done, and use cases through an interview-style listening process.\nCollating and classifying quantitative and qualitative client and Emsi staff inputs and anecdotes to document insights that inform product strategy, roadmaps, and feature prioritization.\nIdentifies, reviews, and establishes importance of trends in trouble tickets and customer contacts\nHelping to design and then implementing workflows and processes that surface data and insights to answer our clients’ core problems.\nIdentifying new market opportunities.\nDiving into and understanding highly technical systems and processes.\nCollaborating with people from many different teams.\nDiscerning the 20% of work that creates 80% of value.\nRolling up their sleeves and doing what needs to be done, even if it isn’t in your comfort zone.\nDetermining tradeoffs between features and bug fixes\nGathering product analytics and baselining current performance of product.\nDrives team sprint productivity and continuous delivery improvement via preparing sprint inputs with detailed acceptance criteria, user stories, and user interface visualizations.\nRequirements\nExperience and\/or training in product design, UI design, software programming and testing, data integration, agile and lean processes, or data visualization\nExperience using product design and prototype software (e.g., Invision, Figma, Miro, Balsamiq, Adobe products )\nStrong written and verbal communication skills and a professional appearance\nStrong task management and follow-through skills\nA high comfort level interpreting and working with data, data formats, and unfamiliar terminology\n\nEmsi Burning Glass is an equal opportunity employer\nAPPLY FOR THIS JOB","Location":"Remote (Work From Home) US","Type":"Full Time","Department":"Product","Link":"https:\/\/jobs.lever.co\/economicmodeling\/5731ab43-1a8e-4ea9-8ea2-a1791ba50a50"},"21":{"Job_Title":"Product Manager","Job_Description":"Emsi Burning Glass, the leader in labour market analytics, helps education and public sector organisations define their skills and curriculum plans, and inform students and workers through SaaS products built on our DaaS platform. We’ve built our company on the integrity of our data and the drive to be insatiably curious when it comes to tackling our customers’ problems. \n\nWe are seeking a Product Manager passionate about bringing insight to customers. The Product Manager will bring new, value-adding product innovations to our current customer base as well as driving growth deeper into our target markets in Higher Education, Further Education, Government, and more. \n\nReporting to the Head of Global Product Management, the Product Manager will own Emsi Burning Glass’s UK products, combining a range of our different labour market data sources to inform customers’ decision-making. You will work with the UK Sales, Customer Service, and Marketing teams along with our US-based engineering teams to define, design, build and launch improvements and solutions. Emsi Burning Glass is a fast-growing international company with a growing UK presence, and this opportunity will suit somebody with a growth mindset, and the ability to work independently with initiative as well as collaboratively with diverse stakeholders.\nResponsibilities\nManage product development according to roadmap across multiple platforms for the UK\nGather feedback and analyse customer data to identify and prioritise market needs\nDevelop and communicate new product concepts to meet those needs\nFormulate compelling business cases for new product investments\nShepherd product developments from concept through to successful launch\nManage and develop regional product knowledge base to ensure up-to-date content and a streamlined user experience\nKnowledge, Skills, and Abilities\n1-3 years experience in a product management, UX\/UI, or project management role\nSome experience in customer research and user data analysis, with relevant skills\nKnowledge of agile processes\nExperience in html, css, and wordpress and\/or other CMS\nExperience in prototyping applications, video and photo editing\nExperience designing product features and iterating them to development\nStrong written and verbal communication skills\nSkills in managing multiple projects and stakeholder relationships\nAbility to thrive in the world between clarity and chaos\nFlexibility in work schedule to meet the needs of communicating with teams in other time zones\nEmsi Burning Glass is an equal opportunities employer.\nAPPLY FOR THIS JOB","Location":"Basingstoke, Hampshire, UK","Type":"Full Time","Department":"Product","Link":"https:\/\/jobs.lever.co\/economicmodeling\/0086b5ad-1dd8-480a-87df-471d8362d05e"},"22":{"Job_Title":"Product Manager","Job_Description":"The Community Insights Product Team at Emsi Burning Glass is laser-focused on helping communities provide constituents with the opportunities they need to thrive in a competitive labor market. Our current products turn labor market data into insights that support local workforce development efforts, advance regional economic development, and provide insights on site selection for companies. Our new products will continue to drive impact for regions, job seekers, and in the labor market at large and we’re on the hunt for a new product manager to join our team to help build them. \n\nAs a product manager at Emsi Burning Glass, you'll be responsible for facilitating our entire product development cycle. You will continuously build on your understanding of the challenges present in communities and the uses of labor market data in that context. You'll talk to our customers to empathize with their needs. You’ll validate opportunities for new products and capabilities and collaboratively define simple, elegant, and effective solutions. You will partner with data and engineering teams to scope, prioritize, and deliver new capabilities. You’ll work with marketing and sales to launch new products and capabilities. Finally, you’ll gather data and feedback to drive future iteration and improvement.\n\nWhy You’ll Love This Role: You’ll help shape the future of workforce and economic development -- the strategy and vision you co-create and implement will impact workforce development programs and reskilling of job seekers throughout North America. You’ll play a key role in evolving our innovative product culture, taking new products and capabilities from concept to launch. You’ll join a collaborative, supportive team that insists on having fun at work.\n\nWhy We’ll Love You: With 5+ years of experience in product management, you have experience with product strategies and processes that enable innovation and drive go-to-market efficiency. You bring a broad toolkit for product development (e.g. agile development processes, lean product development, value proposition design, design thinking, UX best practices).You have a proven ability to build relationships and influence across the organization as well as superior communication and presentation skills. You demonstrate both technical and commercial acumen and are able to communicate what is possible and what will have the biggest impact on the business.\n\nYou’re flexible and hands-on. You have demonstrated success defining and shipping remarkable products in an iterative manner, with a willingness to do whatever it takes from an execution perspective. You’re comfortable deep in the data - both the data you use to inform product direction and the labor market data and insights that power our products. You’re passionate about the future of workforce and economic development and understand the complex environment in which our communities operate.  If you don't think you meet all of the job criteria and are still interested in the job, please apply! We know that a diverse workforce enriches us with the talent, perspective, and inspiration we need to achieve our mission. Nobody checks every box, and we're looking for someone excited to join our team.\n\n\nAPPLY FOR THIS JOB","Location":"Remote (Work From Home) US","Type":"Full Time","Department":"Product","Link":"https:\/\/jobs.lever.co\/economicmodeling\/6d71521c-1175-4d06-9f6f-09010ad2c29a"},"23":{"Job_Title":"Product Specialist","Job_Description":"Emsi Burning Glass, the leader in labor market analytics, is seeking a product specialist who is passionate about helping our clients better serve their people through data and software.\n\nIn this role, you will primarily help with projects that support API Customer Experience by driving improvements to documentation content, client communication mechanisms as well as API and Snowflake client interface.\n\nThis is a fantastic entry-level position where you will work alongside other product operations specialists and be assigned side projects that grow your exposure to and skills in other types of data, projects, and technologies at Emsi Burning Glass.  \n\nRequirements:\nTask orientation – you can work quickly and efficiently through a list of assignments\nAttention to detail – you can quickly and easily find and correct errors\nOrganized – you can keep track of and balance work across multiple concurrent projects\nHigh reading speed and comprehension\nAbility to make quick and confident judgments\nA high comfort level working with informational data\nAbility to work independently and handle ambiguity\nWillingness to roll up your sleeves and do what needs to be done, even if it isn’t in your comfort zone\nWillingness to learn new skills related to data, projects, technologies, team collaboration, and serving customers at EmsiBG\nPreferred Qualifications:\nPrior experience interacting directly with customers in a service or communication role\nPrior experience with project management\/coordination\nExceptional written and verbal communication skills\nBasic SQL Experience\nExperience using APIs\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Product","Link":"https:\/\/jobs.lever.co\/economicmodeling\/c860964f-7795-4211-b117-f689c53f61a7"},"24":{"Job_Title":"Software Product Manager","Job_Description":"Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Our Analyst SaaS product combines many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. As we look to make better and better use of our industry-leading data, we need a product manager to help manage the Analyst software platform. \n\nWith tremendous runway in multiple markets, we are looking for a thoughtful, data-driven, customer-focused product manager to manage and sequence projects on the Analyst platform. This senior product role will also be responsible for identifying and pursuing new platform capabilities and efficiencies, as well as assessing platform usage through analytics software.\n\nIf you’re ready to join a high-functioning team of product managers working closely with talented engineers, designers, and data experts, we’d love to hear from you. \nJob Responsibilities\nGrow platform utilization. Using an experimental and user metrics driven approach, drive new value and new capabilities on the platform. Expand usage of the existing capabilities across products, and identify and eliminate waste.\nBe the single point of contact for the Analyst platform. Coordinate updates and documentation with teams in legal, marketing, sales, etc.. For example, updating in-tool privacy policies, updating in-tool integrations, and vendor questionnaires. \nOwn platform statistics and usage data. Address one-off data pull requests while managing and implementing systems for collecting needed usage data. \nCoordinate projects that involve multiple internal teams. Drive integrated product initiatives like data updates and API changes. \nOwn platform backlogs. Communicate with product owners to optimize work sequencing, identify engineering capacity, and clarify requirements. \nProficiencies\nStrong written and verbal communication skills\nStrong organizational skills\nAbility to clearly articulate technical concepts\nIndependent data gathering skills\nBasic data analysis skills\nUX\/UI generalist\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Product","Link":"https:\/\/jobs.lever.co\/economicmodeling\/1454d90e-65d4-4a78-b6e2-8ced1c6a01a8"},"25":{"Job_Title":"Sr. Product Designer","Job_Description":"The Education Product & Design Team at Emsi Burning Glass is laser-focused on helping institutions provide students with the educational opportunities they need to thrive in a competitive labor market. Our current products turn labor market data into insights that drive new academic program development, help institutions attract, retain and support students, and track post-graduate outcomes. Our new products will continue to drive impact in higher education, for students, and in the labor market at large. We’re on the hunt for a talented designer to join our team.\n As a designer at Emsi Burning Glass, you will design and deliver elegant product experiences as part of a cross-functional team. You will continuously build on your understanding of the challenges present in higher education and the uses of labor market data in that context. You'll talk to our customers to empathize with their needs. You’ll partner with product managers and engineers to design solutions that serve customer and learner needs and deliver value for the company.  \nWhy You Will Love This Role!\nYou’ll help shape the future of higher education -- the product interactions you co-create will impact the educational opportunities and workplace readiness of learners all over the globe.\nYou’ll play a key role in evolving our design culture helping to define and drive new design processes.\nYou’ll join a collaborative, supportive team that insists on having fun at work.\nWhy We'll Love You!\nWith 5+ years of experience in software product design, you have a portfolio that demonstrates your experience creating sketches, wireframes, userflows, and high-fidelity prototypes that define mobile and desktop interfaces for data-rich products.  You’re proficient with Figma, Sketch, Invision or similar design and prototyping tools.\nYou bring a broad toolkit for product design (e.g. design thinking, lean UX, design sprints) and you keep up to date with best practices in usability, accessibility, and visual design.\nYou’re an excellent communicator with a proven ability to build cross-functional relationships and influence. You clearly communicate design decisions and synthesize and iterate based on feedback.\nYou’re comfortable balancing multiple workstreams and building process where it’s needed. Your ability to see the bigger picture helps you prioritize and work efficiently. Your attention to detail means you deliver elegant, consistent designs.\nIf you don't think you meet all of the job criteria and are still interested in the job, please apply! We know that a diverse workforce enriches us with the talent, perspective, and inspiration we need to achieve our mission. Nobody checks every box, and we're looking for someone excited to join our team.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Remote (Work From Home) US","Type":"Full Time","Department":"Product","Link":"https:\/\/jobs.lever.co\/economicmodeling\/f2ec98d7-7508-41f2-ad8a-d249b7e1d44a"},"26":{"Job_Title":"API Support Engineer","Job_Description":"Emsi Burning Glass is seeking a hard-working and team-oriented API Support Engineer to join the organization. The API Support Engineer serves as the go-to technical resource for Emsi Burning Glass API clients. The primary function of this role is to support Emsi Burning Glass API customers in the post-sales customer support environment. This role will assist clients with establishing API credentials, helping them understand the client support process, integrating Emsi Burning Glass data via API into their own software applications and assisting the Talent Account Management teams in retaining API business.\nRequirements:\nProficiency with at least one scripting language such as Python (preferred), JavaScript, or PHP and the ability to assist with client Emsi Burning Glass API customer service requests and implementations\nExperience in developing API calls and extracting raw data programmatically from APIs\nExcellent verbal communication skills\nExcellent problem-solving skills and the desire to troubleshoot\nA customer service attitude with a desire to help teammates and clients solve challenges\nCustomer service experience is a plus\nAbility to build custom-engineered data files directly from Emsi Burning Glass APIs and Snowflake environments\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Professional Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/88ed06a7-fc6e-4901-9dd8-e06a9188a3d7"},"27":{"Job_Title":"Consulting Analyst","Job_Description":"The Research Analyst at EMSI Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objectives of this position, a successful candidate will be committed to a service-first mindset and strive to empower our clients, our employees, and our communities.\nCore Responsibilities\nSupport client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for global employers.\nDevelop knowledge of issues related to human resources, workforce analytics and planning, and\/or the impact of emerging technologies on the future of work.\nGenerate custom datasets, reports, and visualizations that solve clients’ most pressing workforce challenges.\nCommunicate key insights and recommendations to clients and consult clients on how to use data to make data-driven decisions.\nDevelop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences.\nContribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague.\nKnowledge, Skills, Abilities\nStrong written and verbal communication skills.\nStrong analytical skills.\nStrong quality assurance skills with attention to detail in both quantitative analyses and technical writing.\nProficiency with SQL, Python, or related analytical tools and programming languages.\nProficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint.\nAbility to work effectively both independently and in a team environment.\nCreative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings.\nAbility to compose written analyses that explain complex economic or analytical concepts in simple terms.\nCredentials and Experience\nBachelor’s degree or above in a field with a strong quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis.\nExperience making and communicating data-driven decisions, preferably in a role related to consulting, human resources, workforce planning, economic analysis, or a similar environment.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Full Time","Department":"Professional Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/e3c188d5-1310-4bba-b333-e0b4fe7cc7a1"},"28":{"Job_Title":"Research Analyst","Job_Description":"The Research Analyst at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights.\nCore Responsibilities\nSupport client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for global employers.\nDevelop knowledge of issues related to human resources, workforce analytics and planning, and\/or the impact of emerging technologies on the future of work.\nGenerate custom datasets, reports, and visualizations that solve clients’ most pressing workforce challenges.\nCommunicate key insights and recommendations to clients and consult clients on how to use data to make data-driven decisions.\nDevelop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences.\nContribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague.\nKnowledge, Skills, Abilities\nStrong written and verbal communication skills.\nStrong analytical skills.\nStrong quality assurance skills with attention to detail in both quantitative analyses and technical writing.\nProficiency with SQL, Python, or related analytical tools and programming languages.\nProficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint.\nAbility to work effectively both independently and in a team environment.\nCreative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings.\nAbility to compose written analyses that explain complex economic or analytical concepts in simple terms.\nCredentials and Experience\nBachelor’s degree or above in a field with a strong quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis.\nExperience making and communicating data-driven decisions, preferably in a role related to consulting, human resources, workforce planning, economic analysis, or a similar environment.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Full Time","Department":"Professional Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/7fb034cf-bbfc-437c-8279-3a336a77fafc"},"29":{"Job_Title":"Research Analyst","Job_Description":"At Emsi Burning Glass, we strive to create a job market that works for everyone. Our analytics software and custom research are powered by the world’s largest and most sophisticated database of jobs and talent. We deliver real-time data, breakthrough planning tools, and tailored research that inform careers, define academic programs, and shape workforces.\n\nWe seek a Research Analyst to join our Community Insights team. The Research Analyst will perform quantitative research to investigate important issues in the labor market, support client engagements, and improve the data available for Emsi Burning Glass products.\n\nThe Community Insights team at Emsi Burning Glass provides accurate and local labor market information to partners in workforce development, government, industry, and the social sector. The Community Insights team is focused on getting people into good jobs that support their lives, their families, and their communities.\n\nOur research is driving the national conversation around some of the most critical issues facing the job market. We reveal labor market trends for inclusion in leading national publications such as the New York Times, the Wall Street Journal, the Economist, and for partners such as the World Economic Forum, and we identify the emerging skills and job opportunities that inform major investments in skills training by local, state and national governments, corporations, schools and universities, and major philanthropic and corporate foundations.\n\nThe ideal candidate will possess both strong quantitative research skills and will have a passion for using data to illustrate key trends and tell actionable stories.\nResponsibilities Include:\nLeverage labor market data to address client needs in education, government, and the private sector through a combination of data analysis and narrative and visual storytelling.\nManipulate, validate, and analyze data using SQL, Python, and other analytical tools to develop insights about emerging trends in the labor market.\nCompare summary statistics on supply and demand across industries and geographies, constructing indices to measure labor market concepts such as innovation and digitization and performing trend analyses to measure changes in job characteristics over time.\nCreate visualizations of complex data sets using Tableau, Python, and\/or Excel to tell compelling stories.\nPull and prepare data for public reports and media outreach efforts.\nGenerate first drafts of client-ready outputs in Excel and PowerPoint and contributing to written reports on research outcomes.\nParticipate in client and company-wide meetings and presentations.\nContribute to positive team dynamics by participating in team-building activities and be a supportive colleague.\nRequirements:\nUndergraduate degree in economics, statistics, or another quantitatively intensive field.\nExperience manipulating, cleaning, and analyzing large datasets.\nProficiency in at least one of the following statistical analysis\/data management tools: SQL, R, Python, SAS, or STATA.\nExperience creating data visualizations in Python, Excel, PowerPoint, Tableau, R, or other rools.\nHighly detail-oriented with superior organizational skills.\nProficiency in Excel and PowerPoint.\nExcellent writing and communication skills.\nIntense intellectual curiosity.\nOpportunities within Emsi Burning Glass also exist on other teams. Please visit our job board to view open positions.\n\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Full Time","Department":"Professional Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/a8e0ddfa-f0ff-429e-b3da-7b3b7aedf00a"},"30":{"Job_Title":"Research Analyst Intern","Job_Description":"The Research Analyst Intern at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights.\nJob Duties and Responsibilities\nSupport client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for global employers.\nGenerate custom datasets, reports, and visualizations that solve clients’ most pressing workforce challenges.\nCommunicate key insights and recommendations to clients and consult clients on how to use data to make data-driven decisions.\nDevelop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences.\nContribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague.\nEssential Functions, Knowledge, Skills and Abilities\nEnrolled in or a recent graduate of a Bachelor’s or Master’s degree program in economics, public administration, business, data science, community planning, public policy, or related field\nStrong analytical and technical skills and demonstrated ability to apply economic theory or statistical techniques\nAbility to write about and explain complex concepts in simple, concrete terms\nAbility to meet milestones while juggling multiple responsibilities\nAbility to work independently, while learning from members of the team\nKeen business development sense and strong client relationship skills\nStrong proficiency with MS office (particularly Excel, Word, and PowerPoint) and SQL, Python, or related applications is required. Experience with Tableau is ideal.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Internship","Department":"Professional Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/3737fac0-90e8-4756-96ba-67893d393b57"},"31":{"Job_Title":"Research Lead","Job_Description":"At Emsi Burning Glass, we strive to create a job market that works for everyone. Our analytics software and custom research are powered by the world’s largest and most sophisticated database of jobs and talent. We deliver real-time data, breakthrough planning tools, and tailored research that inform careers, define academic programs, and shape workforces.\n\nWe seek a Research Lead to join our Community Insights team. The Research Analyst will perform quantitative research to investigate important issues in the labor market, support client engagements, and improve the data available for Emsi Burning Glass products.\n\nThe Community Insights team at Emsi Burning Glass provides accurate and local labor market information to partners in workforce development, government, industry, and the social sector. The Community Insights team is focused on getting people into good jobs that support their lives, their families, and their communities.\n\nOur research is driving the national conversation around some of the most critical issues facing the job market. We reveal labor market trends for inclusion in leading national publications such as the New York Times, the Wall Street Journal, the Economist, and for partners such as the World Economic Forum, and we identify the emerging skills and job opportunities that inform major investments in skills training by local, state and national governments, corporations, schools and universities, and major philanthropic and corporate foundations.\n\nThe ideal candidate will possess both strong quantitative research skills and will have a passion for using data to illustrate key trends and tell actionable stories.\nResponsibilities Include:\nLeverage labor market data to address client needs in education, government, and the private sector through a combination of data analysis and narrative and visual storytelling.\nDetermine analytical approaches, methodologies, and data points that will meet client needs, and develop the roadmap to collect or create those data points.\nDevelop and implement novel research methodologies, and support others’ development of novel research approaches.\nManipulate, validate, and analyze data using SQL, Python and other analytical tools to develop insights about emerging trends in the labor market.\nProvide final validation of analytical results and visualization and sign-off on client-readiness\nCreate visualizations of complex data sets using Tableau, Python and\/or Excel to tell compelling stories.\nGenerate first drafts of client-ready outputs in Excel and PowerPoint and contributing to written reports on research outcomes, and supervise development of subsequent drafts of final deliverables.\nDecide on how final conclusions will be presented to client, ensuring that key conclusions are clear and relevant.\nParticipate in client and company-wide meetings and presentations.\nContribute to positive team dynamics by participating in team-building activities and being a supportive colleague.\nRequirements:\nMaster’s degree (preferred) or undergraduate degree in economics, statistics, or another quantitatively intensive field.\nExperience manipulating, cleaning, and analyzing large datasets.\nExperience overseeing research projects from beginning to end.\nExperience working with external clients or stakeholders on research projects.\nProficiency in at least one of the following statistical analysis\/data management tools: SQL, R, Python, SAS, or STATA.\nExperience creating data visualizations in Python, Excel, PowerPoint, Tableau, R, or other tools.\nHighly detail-oriented with superior organizational skills.\nProficiency in Excel and PowerPoint.\nExcellent writing and communication skills.\nIntense intellectual curiosity.\nOpportunities within Emsi Burning Glass also exist on other teams. Please visit our job board to view open positions.\n\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Full Time","Department":"Professional Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/2a1d0535-0eb0-46b0-b77c-f1a8b6f2fec6"},"32":{"Job_Title":"Senior Consultant","Job_Description":"The Senior Consultant at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objectives of this position, a successful candidate will be committed to a service-first mindset and strive to empower our clients, our employees, and our communities.\nCore Responsibilities\nSupport client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for enterprise-scale clients.\nDevelop project plans and oversee the execution and successful completion of custom consulting and research deliverables.\nDevelop subject matter expertise on issues related to human resources, workforce analytics and planning, and\/or the impact of emerging technologies on the future of work.\nGenerate custom datasets, reports, dashboards, and visualizations that solve clients’ most pressing workforce challenges.\nCommunicate key insights and recommendations to clients, support and nurture client relationships, and consult clients on how to use data to make data-driven decisions.\nDevelop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences.\nContribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague.\nKnowledge, Skills, Abilities\nStrong written and verbal communication skills.\nStrong analytical skills.\nStrong quality assurance skills with attention to detail in both quantitative analyses and technical writing.\nProficiency with SQL, Python, or related analytical tools and programming languages.\nProficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint.\nExperience with Tableau or similar BI tools is a plus.\nKnowledge of human resources, people analytics, HRIS software (such as Workday or SuccessFactors), or related fields is a plus.\nPrior project management experience is strongly preferred.\nKeen business development sense and strong client relationship skills.\nAbility to work effectively both independently and in a team environment.\nCreative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings.\nAbility to compose written analyses that explain complex economic or analytical concepts in simple terms.\nCredentials and Experience\nBachelor’s degree or above in a field with a strong quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis.\nExperience making and communicating data-driven decisions, preferably in a role related to consulting, human resources, workforce planning, economic analysis, or a similar environment.\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Boston, Massachusetts","Type":"Full Time","Department":"Professional Services","Link":"https:\/\/jobs.lever.co\/economicmodeling\/58606b13-40fa-4dbe-942a-94c0bf722cf1"},"33":{"Job_Title":"Social Media Manager","Job_Description":"Emsi Burning Glass is searching for a talented marketing professional to join our team as a Social Media Manager. This position oversees the daily management of, and strategic plan development and implementation for, Emsi Burning Glass social media accounts (Linkedin, Twitter. Facebook, Instagram, and Youtube). The strategy will focus on driving results in all areas of the customer journey, creating awareness, generating engagement, and continuously promoting our content to key market segments.\nThe primary job duties of this include:\nSupporting the company brand among existing and potential clients and other stakeholders.\nDriving a larger number of potential clients and potential employees to the Emsi Burning Glass website.\nAmplifying the Emsi Burning Glass voice in the corporate, higher-ed, and government online echo chambers.\nOwn the global posting strategy, in collaboration with the corporate communications team, across all networks that build our reputation and drive engagement.\nResearch, develop and implement unique strategies across platforms, rooted in analytics.\nConsistently develop and execute quantifiable testing strategies and report back the results to the greater marketing team.\nCollaborate with various stakeholders on content priorities and coordination.\nCollaborate with the Art Director, business unit writers on content to share.\nPartner with the digital marketing team to uphold best practices for paid social campaign execution.\nExperience and Skills:\n2+ years of hands-on experience executing social media strategies.\nDemonstrated success improving social programs across KPIs like engagement, conversions, and pipeline generation.\nUnderstanding of organic social, paid social and digital marketing best practices and latest tools and trends.\nStrong project management skills and relationship-building skills across various teams.\nData-driven and very comfortable with handling and analyzing data, and building reports to track performance metrics.\nComfortable presenting ideas and reports to stakeholder groups and leadership.\nExperience with copywriting.\nDegree in marketing, communications, or related fields preferred.\nEmsi Burning Glass is an equal opportunity employer\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Public Relations","Link":"https:\/\/jobs.lever.co\/economicmodeling\/4db56402-4130-4f30-b423-26ffb693471c"},"34":{"Job_Title":"Enterprise Account Executive","Job_Description":"Emsi Burning Glass is hiring results-driven Enterprise Account Executives who will help develop long-term client relationships within defined multi-state territories. Enterprise Account Executives identify, mature, and close new business through active prospecting and also through our partner\/channel environment.  Our territories are massive, and the opportunity for growth and large-scale business development is upon us.  We value hunger, intelligence, and a professional who conducts business with impeccable integrity and client-centricity.  We have a growth track with immense potential in the human capital space; the opportunity to make a huge impact on the labor market, organizations and people is primed for the right business developers that want to contribute to the growth and enjoy being a part of one of the best organizations in the space. \nJob Requirements\nProspect within enterprise accounts via phone, email, social selling, and other creative outbound\/inbound and channel-driven approaches.\nBuild a pipeline with positive professional client relationships while working in collaboration with internal team members in marketing, consulting, customer-service and product development, to provide the best solutions for our clients\nWork with multiple client contacts to create demand across the business as you leverage the executive buying cycle\nEngage a consultative sales methodology with an average sales cycle of 9 months or less\nHelp potential customers define needs clearly and deliver software, data and consulting solutions that empower these organizations to optimize talent management strategies\nUse research, creativity, and analysis to craft and deliver highly relevant presentations to clients via online and in-person meetings \nLearn and use the economic and data concepts that relate to our services and the situations of our clients\nEffectively mentor and guide your assigned Business Development Rep to help generate leads\nSpecific Qualifications\n4+ years experience with consultative and\/or solution-based software sales\nTrack record of consistent performance (top 10-20% of company)\nFamiliarity with the human resources function and HR tech\/consulting space is a huge asset\nEnergetic, optimistic, and entrepreneurial\nDesire to work in a mature, sophisticated, and professional client\/sales environment\nExcellent time-management and communication skills, verbal\/written\/visual\nAbility to positively adapt to change in a highly dynamic work environment\nAbility to travel as needed, as appropriate in today’s selling environment\nOutstanding written and verbal communication, presentation, and time management skills\nTechnically savvy (familiarity with sales automation tools) and specifically skilled using Salesforce to manage sales cycles\nProcess-driven, organized and self-motivated\nBachelor’s degree in business, communication, HR or other related fields\nEmsi is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Sales","Link":"https:\/\/jobs.lever.co\/economicmodeling\/d97bf376-f693-4e15-9b7b-e27bf5da4eb1"},"35":{"Job_Title":"Solutions Consultant","Job_Description":"Emsi Burning Glass (EBG) is looking for a talented individual to provide pre-sales support to our Higher Education sales team. Our Solutions Consultant's primary role is to support sales efforts with extensive product knowledge, answer questions, and demonstrate product capabilities as needed. At EBG, our Solutions Consultant usually enters the buyer’s journey after they’ve already completed one, or even several meetings with an Account Executive or Sales Representative. A great candidate will be able to 1) answer (accurately) all of the deep technical questions that a sales representative can’t, 2) demonstrate our product to the client, and 3) use the product to craft solutions to complex customer problems.\n\n\n\nPrimary Responsibilities\nWork with Sales Representatives to interface with clients prior to deal close \nPrepare and deliver technical presentations that explain products or services to prospective clients in a sales support capacity\nConfer with prospective clients and engineers to assess implementation requirements related to their internal capabilities\nInterface with the sales teams\nProvide technical support and advise the sales teams on given opportunities where appropriate \nRecommend and propose solutions to the Account Executives prior to client presentations\nInterface with the data and engineering teams\nResearch technical questions related to EBG products to provide real-time and follow up support for technical sales opportunities \nProvide feedback to the Product team on a monthly basis based on customer requirements\/interactions for the purpose of product modification\/development\nHelp determine the interoperability of Application Programming Interface (API) with other vendors and catalog the list for the purpose of Product Development and Sales vetting \nBuild Minimum Viable Product (MVPs) for custom integrations (i.e. - Our SkillsMatch product within SalesForce)\nKnowledge, Experience & Skills Required\nBachelor's degree or coursework in business or computer science-related field.\nExperience working with or knowledge data structures\nUnderstands the principles of REST API Design\nSome ability with Python (to build customer-facing prototype data pulls)\nFamiliarity with Sales operations tools like SalesForce, SalesLoft, etc. a plus\nClient-facing experience, preferably in a sales support capacity.\nBackground in a SaaS\/DaaS company a plus\nEmsi Burning Glass is an equal opportunity employer.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Full Time","Department":"Sales","Link":"https:\/\/jobs.lever.co\/economicmodeling\/4bdc81e9-40f9-4de3-98ff-fdfbf1556328"},"36":{"Job_Title":"Join Our Talent Network!","Job_Description":"Didn't find a job posting, but want to keep in touch? Submit your resume here, and we will reach out with any job openings that we think could be a good fit.\n\nIf you have any questions about Emsi, feel free to reach out to Aine Haynes, Talent Acquisition Specialist, at aine.haynes@economicmodeling.com\nAbout Emsi\n\nWe provide the best labor market data available to professionals in higher education, economic development, workforce investment, talent acquisition, and site selection. Our data, which covers more than 99% of the workforce, is compiled from a wide variety of government sources, job postings, and online profiles and résumés. Our amazing clients use Emsi data to solve a variety of problems: align programs with regional needs, equip students with career visions, understand regional economic and workforce activity, and find and hire the right talent. We serve clients across the US, the UK, Canada, and Australia. Headquartered in Moscow, Idaho, in the heart of the beautiful Palouse region, Emsi also has offices around the US and in the UK.\nAPPLY FOR THIS JOB","Location":"Moscow, ID","Type":"Uncategorized","Department":"Talent Network","Link":"https:\/\/jobs.lever.co\/economicmodeling\/ad5f4959-9276-4fba-8ddf-390446c6b95c"}}